package com.example.common.response;

public enum Message {
	
	SUCCESS(200,"成功"),
	TOKEN(401,"TOKEN 不可用"),
	
	FAIL_1001(10001,"手机号错误"),
	FAIL_1002(10002,"验证失败,请重新发送验证码"),
	FAIL_1003(10003,"账号已存在"),
	FAIL_1004(10004,"账号不存在"),
	FAIL_1005(10005,"您已经实名认证过啦"),
	FAIL_1006(10006,"身份证号错误"),
	FAIL_1007(10007,"参数错误"),
	
	
	FAIL_1008(10008,"金额不能为空"),
	FAIL_1009(10009,"第三方交易号不能为空"),
	FAIL_1011(10010,"锁编号不存在"),
	
	FAIL_1012(10012,"请实名认证"),
	FAIL_1013(10013,"您已被列入黑名单"),
	FAIL_1014(10014,"您借车未还"),
	FAIL_1015(10015,"余额不足"),
	
	FAIL_1016(10016,"请求太频繁了呢，请一小时后再来试一下吧"),
	FAIL_1017(10017,"未知原因"),
	FAIL_1018(10018,"请输入真实姓名"),
	FAIL_1019(10019,"请输入正确的证件号"),
	FAIL_1020(10020,"您已缴纳过押金啦，请勿重复缴纳"),
	
	FAIL_1021(10021,"微信支付失败"),
	FAIL_1022(10022,"调用第三方平台解锁失败"),
	FAIL_1023(10023,"您的退还押金申请正在审核中"),
	FAIL_1024(10024,"您没有押金可以退还"),
	FAIL_1025(10025,"订单不存在"),
	FAIL_1026(10026,"该车非待借用状态"),
	FAIL_1027(10027,"您的余额已冻结不可使用"),
	FAIL_1028(10028,"您的押金余额为0"),
	FAIL_1029(10029,"押金缴纳失败"),
	FAIL_1030(10030,"该用户无效"),

	FAIL(100,"失败");
	
	public int code;
    public String message;
    
    Message(int code, String message) {
        this.code = code;
        this.message = message;
    }
}
